app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("name", "reference", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Mesa"], ["reference", "M1"], ["description", "Esto es una mesa"], ["created_at", "2022-09-27 17:55:46.000598"], ["updated_at", "2022-09-27 17:55:46.000598"]]

  def new_movement
    @product = Product.find(params[:id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create_movement
    @product = Product.find params[:id]
    @movement = Movement.new(movement_params)
    @movement.product_id = @product.id
    if @movement.save
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "movements" ("product_id", "movement_type", "quantity", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["product_id", 1], ["movement_type", 0], ["quantity", 100], ["comment", "He creado 100 para empezar"], ["created_at", "2022-10-01 03:31:43.854910"], ["updated_at", "2022-10-01 03:31:43.854910"]]